# Assignment 01 - Python Programming Foundations using Jupyter Notebook
**Name:** Anum  
**Course:** Basics of Python  
**Date:** 07 July 2025  

---

This notebook implements all sections of the PDF tutorial. Each section includes:
- Code examples
- Output cells (where applicable)
- Markdown explanations
- Error handling and fixes (if any)

## 1. Introduction to Python

In [ ]:
# Python is open-source and widely used in data analytics
print("Hello, Python World!")

Python is a versatile programming language known for its simplicity and wide range of libraries. It is interpreted, open-source, and widely used in data analysis, web development, and automation tasks.

## 2. Data Types in Python
Python supports multiple data types like variables, numbers, strings, lists, dictionaries, tuples, and sets.

## 2.1  Variables and Numbers

In [9]:
# Variables
counter = 100.00  # float type
miles = 100       # integer type
name = "Mehvish"  # string type
print(counter)
print(miles)
print(name)

100.0
100
Mehvish

## 2.2 Numbers

This data type stores numeric values.  
They are **immutable** data types (i.e., changing the value of a Number data type results in a **newly allocated object**).

Some examples are given below

In [18]:
2 #integer

2

In [20]:
 2+3 #integer

5

In [22]:
2.3+5.5 #float

7.8

In [34]:
2**2 #exponent

4

## 2.3 Strings 
String data types are used to store words or combination of words having letters, numbers, special characters etc.
 It can be stored by enclosing within single qoutes and double qoutes also.
 Python doesn't support char data type. It will be as String of length one in Python.

In [29]:
name = 'Mehvish'
university = "COMSATS"
print(name,university)

Mehvish COMSATS

## Access values in String 
Python doesn't support Character data type. These are treated as Strings of length one.
 Square brackets are used to access substrings.
 We can access a specific character or range of characters from string.

In [32]:
stringVariable = 'Hello World'
print("stringVariable[0]:", stringVariable[0]) 
print("stringVariable[1:5]:", stringVariable[1:5])

stringVariable[0]: H
stringVariable[1:5]: ello

## Updating String 
Value of the string can be updated by assigning a new value to it. New value will be replaced with older.
 New value must be related (having same data type) to previous value of the string.

In [39]:
stringVariable = "Hello World"
stringVariable = stringVariable[:6] + "Python" 
print("Updated string: ", stringVariable)

Updated string:  Hello Python

## Delete String 
To delete the value of the string, just delete its object (reference variable).

In [44]:
stringVariable = "Hello World"
print (stringVariable)
del stringVariable
print (stringVariable)

Hello World

NameError: name 'stringVariable' is not defined

## String special operators
Some special operators are used in Python to assist the user. These are given below. 
'+' operator is used for concatenation.

In [47]:
variable = "Hello"
print(variable+"Python")

HelloPython

In [49]:
variable = "Hello"
print(variable*3)

HelloHelloHello

In [53]:
variable="Hello"
print ( variable[1])

e

In [55]:
variable = "Hello"
print(variable[1:3])

el

In [57]:
variable = "Hello"
print('G' not in variable)

True

## String formatting operator 
One of the coolest feature is string formatting operator within print statement.

In [60]:
print ("My name is %s and age is %d kg!" % ("Zara",21))

My name is Zara and age is 21 kg!

## 2.4 Lists 
It can be written as a list of comma-seperated values within square brackets.
 Multiple types of data can be stored in a List.
 Individual elements of a list can be changed (it can be read and write).
 List indices starts from 0 just like arrays

In [63]:
list1 = ['Mehvish','1880']
print(list1)

['Mehvish', '1880']

## Accessing values in Lists 
Square brackets are used to access the values of a list.
 We can access a specific values or range of values from list.

In [66]:
list1 = ['physics', 'chemistry', 1997, 2000];
list2 = [1, 2, 3, 4, 5, 6, 7 ]; 
print ("list1[0]: ", list1[0]) 
print ("list2[1:5]: ", list2[1:5])

list1[0]:  physics
list2[1:5]:  [2, 3, 4, 5]

## Updating Lists 
We can update single or mupltiple elements of a list by giving slice on left hand of the assignment operator.
 It can also be updated using append() function.

In [69]:
list1 = ['physics', 'chemistry', 1997, 2000];
list1[1] = "computer science"
print(list1) 
list1.append('Computer Science') 
print(list1)

['physics', 'computer science', 1997, 2000]
['physics', 'computer science', 1997, 2000, 'Computer Science']

In [71]:
list1 = ['physics', 'chemistry', 1997, 2000]; 
print (list1) 
del list1[2];
print ("After deleting value at index 2 : ") 
print (list1)

['physics', 'chemistry', 1997, 2000]
After deleting value at index 2 :
['physics', 'chemistry', 2000]

In [73]:
list1 = ['physics', 'chemistry', 1997, 2000]; 
print (list1) 
list1.remove('chemistry')
print ("After deleting value at index 2 : ") 
print (list1)

['physics', 'chemistry', 1997, 2000]
After deleting value at index 2 :
['physics', 1997, 2000]

## 2.5 Dictionaries 
It is same as array of objects having key and values in PHP.
 Each key is seperated by colon (:) from its value.
 Each item is seperated with comma (,).
 Empty dictionary can be written as {}.
 Keys are unique in dictionary but values may not.
 The values of the dictionary can be of any data type.
 The keys must be of an immutable data type such as strings, numbers, or tuples.

In [76]:
dict1 = {'Name': "Mehvish", 'Depart': "BCS", 'Batch': 2014}
print(dict1['Name'])

Mehvish

## Updating Dictionary & Delete Dictionary Element 
We can update already existing value in dictionary.
 We can also add a new entry in dictionary. 
 We can delete individual element of dicitionary and complete content of dictionary.
 del is used for individual element removal and clear() function is used to remove entire dictionary.

In [78]:
dict1 = {'Name': "Mehvish", 'Depart': "BCS", 'Batch': 2014}
dict1['Batch'] = "SP14"
dict1['University'] = "COMSATS"
print(dict1)
del dict1['Batch']
print(dict1)
dict1.clear()

{'Name': 'Mehvish', 'Depart': 'BCS', 'Batch': 'SP14', 'University': 'COMSATS'}
{'Name': 'Mehvish', 'Depart': 'BCS', 'University': 'COMSATS'}

## 2.6 Tuples 
It is same as list. The differences between tuples and lists are, the tuples cannot be changed. 
Each item is comma (,) seperated. 
Empty Tuple is shown as ().
To write a tuple containing a single value you have to include a comma (,) even though there is only one value. For Exampe: tup = (40,). 
It can also have multiple data type values. 
Like string indices, tuple indices start at 0, and they can be sliced, concatenated, and so on.

## Accessing values in Tuples 
We can use the familiar square brackets along with the index to obtain its value.

In [86]:
tup = ('Math','98', 'C programming', '99')
print (tup) 
print(tup[1]) 
print(tup[1:3])

('Math', '98', 'C programming', '99')
98
('98', 'C programming')

## Updating Tuples 
Tuples are immutable means we can't change it. It is read only.
 We are able to take portions of tuples to make a new tuple.

In [89]:
tup1 = (12, 34.56);
tup2 = ('abc', 'xyz'); 
#Following action is not valid for tuples 
#tup1[0] = 100; 
#So let's create a new tuple as follows 
tup3 = tup1 + tup2; 
print (tup3);

(12, 34.56, 'abc', 'xyz')

## Delete Tuple elements 
Removing individual element in Tuple is not possible because they can't be updated.
 del statment is used to remove entire Tuple.

In [92]:
tup = ('physics', 'chemistry', 1997, 2000);
print (tup);
del tup;
print ("After deleting tup : ");
print (tup);

('physics', 'chemistry', 1997, 2000)
After deleting tup :

NameError: name 'tup' is not defined

## 2.7 Sets 
set is collection of unordered items.
 Every element is unique (No duplicates).
 Every element is immutable (can't be changed).
 However, the set itself is mutable. We can add or remove items from it.
 Sets can be used to perform mathematical set operations like union, intersection, symmetric difference etc.
 Empty set will be written as {}.
 Each item in set will be comma (,) seperated.
 We can make a set from a list using set() function.
 Data type can be found using type() function.
 add() is used to add single value, update() is used for adding multiple values.
 update() function can take tupe, strings, list or other set as argument. In all cases, duplicates will be avoided.
 discard() and remove() are used to to delete particular item from set.
 discard() will not raise an error if item doesn't exists in set.
 remove() will raise an error if item doesn't exists in set.

In [99]:
#list
list1 = [1,2,3,4,5] 
print (type(list1)) 
my_set = set(list1) 
print(my_set) 
(type(my_set)) 
#set of integers 
my_set = {1,2,3} 
print (my_set) 
print
 #set of mixed data types 
my_set = {1,"Hello", 1.2,'C'} 
#adding a single value 
my_set.add('D') 
#adding multiple values 
my_set.update(list1) 
print (my_set) 
my_set.discard('G') # it will not raise an error 
my_set.remove('G') # it will raise an error

<class 'list'>
{1, 2, 3, 4, 5}
{1, 2, 3}
{1, 1.2, 2, 3, 4, 5, 'D', 'Hello', 'C'}

KeyError: 'G'

## 3. Comparison Operators 
These are used to compare values (string or numbers) and return true/false according to situation.

In [2]:
1<3

True

In [5]:
15<=23

True

In [7]:
'Mehvish' == "Zeenat"

False

In [9]:
"Mehvish" != "Mehvish"

False

In [11]:
(1==1)or(5>2)

True

In [13]:
(1<2)and(2<1)

False

## 4. If-Else Statements 
If-Else statments are used to execute a block of code depending on conditions.
 example:

In [24]:
if 25 % 2: 
    print('Even')
else: 
    print('Odd')

Even

## 5. For and While Loop
Python has For and While  loop for iteration, used when we want to perform a specific a task repeatedly.

In [31]:
fact = 1
N = 5
for i in range (1,N+1): 
    fact*=i 
print (fact)

120

In [39]:
a = 0
while a < 10: 
    a = a+1
    print(a)

1
2
3
4
5
6
7
8
9
10

## Functions 
It is a block of organized and reusable code. It is used to perform a single, related action. It provides high modularity for your application. It has a hight degree of code reusing

In [48]:
# Function definition is here
def printme( str ): 
#This prints a passed string into this function 
    print (str)
    return; 
# Now you can call printme function 
printme("I'm first call to user defined function!")

I'm first call to user defined function!

In [50]:
def f (x): 
    return x**2 
print (f(8))

64

In [52]:
#Lambda Function 
#lambda expressions 
times3 = lambda var:var*3 
times3(10) 
#lambda expressions: another way to write a function in line

30

## 7.1 Map() 
Map() function is used with two arguments. Just like: r = map(func, seq). The first argument func is the name of a function and the second a sequence (e.g. a list).seq. map() applies the function func to all the elements of the sequence seq. It returns a new list with the elements changed by func.

In [55]:
sentence = 'It is raining cats and dogs' 
words = sentence.split()
 print (words) 
lengths = map(lambda word: len(word), words) 
list(lengths)

['It', 'is', 'raining', 'cats', 'and', 'dogs']

[2, 2, 7, 4, 3, 4]

## 7.2 Filter() 
The function filter(function, list) offers an elegant way to filter out all the elements of a list.
The function filter(f,l) needs a function f as its first argument. f returns a Boolean value, i.e. either True or False.
This function will be applied to every element of the list l.
Only if f returns True will the element of the list be included in the result list.

In [57]:
fib = [0,1,1,2,3,5,8,13,21,34,55] 
result1 = filter(lambda x: x % 2, fib)
list(result1)

[1, 1, 3, 5, 13, 21, 55]

In [60]:
fib = [0,1,1,2,3,5,8,13,21,34,55] 
result2 = filter(lambda x: x % 2 == 0, fib) 
list (result2)

[0, 2, 8, 34]

## 8. File I/O

In [66]:
from six.moves import input
string = input("Enter your name: ");
print(string)

Enter your name:  Anum

Anum

## I/O from or to Text File 
In this scenario, we'll read and write to a text file. 
r opens a file in read only mode.
 r+ opens a file read and write mode.
 w opens a file in write mode only. 
a opens a file in append mode
 a+ opens a file in append and read mode.

In [77]:
# Open a file to read 
fileOpen = open("Anum.txt", "r+")
str = fileOpen.read(); #to read specific content from start you can use read(12). It will read 12 characters from the start of file 
print (str)
 # Close opend file 
fileOpen.close()

Anum
MCT

In [87]:
# Open a file to append 
fileOpen = open("Anum.txt", "a+") 
fileOpen.write(" Information Technology Lahore"); 
fileOpen.close() 
# Open a file to read 
fileOpen = open("Anum.txt", "r+") 
string = fileOpen.read(); #to read specific content from start you can use read(12). It will read 12 characters from the start of file 
print (string) 
# Close opend file 
fileOpen.close()

Anum
MCT Information Technology Lahore Information Technology Lahore Information Technology Lahore Information Technology Lahore

## File Position 
tell()

seek() 

method tells the currenct position within the file. 
method changes the current file location.

In [94]:

In [4]: 
In [5]: 
# Open a file
fo = open("Anum.txt", "r+")
str = fo.read(10);
print("ReadStringis:\n",str) 
# Check current position
position = fo.tell();
print("Currentfileposition:\n", position)
 #Repositionpointeratthebeginning once again
position = fo.seek(0, 0);
str = fo.read(10);
print("AgainreadStringis:\n", str) 
# Close opend file
fo.close()

ReadStringis:
 Anum
MCT
Currentfileposition:
 11
AgainreadStringis:
 Anum
MCT

In [96]:
import os
 # renameafile
os.rename("Anum.txt","newfile.txt")

In [98]:
os.remove("newfile.txt")

## 9. Pandas Introduction

In [3]:
import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt 
#following a fucntion is called from pandas to create a series. 
s = pd.Series(np.random.randn(5), index=['a', 'b', 'c', 'd','e'])
s

a    1.342994
b    0.834922
c   -2.025612
d    0.036148
e   -0.811327
dtype: float64

In [4]:
s.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [5]:
pd.Series(np.random.randn(5))

0    0.169703
1    0.040583
2    0.398418
3   -0.689345
4   -1.692524
dtype: float64

## 10.2 From dict 
If data is a dict, if index is passed the values in data corresponding to the labels in the index will be pulled out. 
If index is not passed then it will be constructed from the sorted keys of the dict, if possible.

In [6]:
""" In following example, indexes are not given to it is constructed from the sorted keys of the dict""" 
d = {'a' : 0., 'b' : 1., 'c' : 2.} # a python dict
pd.Series(d)

a    0.0
b    1.0
c    2.0
dtype: float64

In [7]:
 """ In following example, index are given, so the values in data corresponding in the index will be pulled out""" 
pd.Series(d, index=['b', 'c', 'd', 'a'])

b    1.0
c    2.0
d    NaN
a    0.0
dtype: float64

## 10.3 From a scalar value

if data is a scalar value, an index must be provided. The value will be repeated to match the length of index

In [12]:
"""In following example, a scalar value is given as data so it will be repeated to match the length of inde x"""
pd.Series(3, index=['a', 'b', 'c', 'd', 'e'])

a    3
b    3
c    3
d    3
e    3
dtype: int64

## 10.4 Series is ndarray-like 
It acts very similarly to a ndarray.
 It is a valid argument to most NumPy functions. However, things like slicing also slice the index.

In [13]:
s[0]

C:\Users\HP\AppData\Local\Temp\ipykernel_15160\243613605.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  s[0]

1.342993602190898

In [14]:
s[:5]

a    1.342994
b    0.834922
c   -2.025612
d    0.036148
e   -0.811327
dtype: float64

In [16]:
#for values greater than median 
s[s > s.median()]

a    1.342994
b    0.834922
dtype: float64

In [17]:
s[[4, 3, 1]]

C:\Users\HP\AppData\Local\Temp\ipykernel_15160\2699684475.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  s[[4, 3, 1]]

e   -0.811327
d    0.036148
b    0.834922
dtype: float64

In [18]:
np.exp(s)

a    3.830493
b    2.304635
c    0.131913
d    1.036809
e    0.444268
dtype: float64

In [19]:
s['a']

1.342993602190898

In [20]:
"""Following example will update the data of the given index""" 
s['e'] = 12. 
s # before updating e = 1.399281 but after updating e = 12.000000

a     1.342994
b     0.834922
c    -2.025612
d     0.036148
e    12.000000
dtype: float64

In [21]:
'e' in s

True

In [22]:
"""If a label is not contained and you are trying to access its data, an exception is raised: """ 
s['f'] 
# This will create error

KeyError: 'f'

In [24]:
#""Using the get method, a missing label will return None or specified default""" 
s.get('f') #it will return none
s.get('f', np.nan) #it will return default value

nan

## 10.6 Vectorized operations and label alignment with Series 
When doing data analysis, as with raw NumPy arrays looping through Series value-by-value is usually not necessary. 
Series can also be passed into most NumPy methods expecting an ndarray.

In [27]:
"""following will add the data of respective values of indexes. For example, in given output, it is calculate """
"""d as: a = s['a'] +
 s['a'] b = s['b'] +
 s['b'] c = s['c'] +
 s['c'] d = s['d'] +
 s['d'] e = s['e'] +
 s['e'] """
s+s

a     2.685987
b     1.669844
c    -4.051225
d     0.072295
e    24.000000
dtype: float64

In [29]:
"""following will multiply the data of each values of indexes, with 2. For example, in given output, it is ca 
lculated as: 
a = s['a'] *2
 b = s['b'] *2
 c = s['c'] *2
 d = s['d'] *2 
e = s['e'] *2"""
s*2

a     2.685987
b     1.669844
c    -4.051225
d     0.072295
e    24.000000
dtype: float64

In [30]:
s = pd.Series(np.random.randn(5), name='something') 
s

0    0.636726
1   -1.415222
2   -2.197750
3   -0.639328
4   -0.278015
Name: something, dtype: float64

In [31]:
s.name

'something'

In [32]:
#rename the series name attribute and assign to s2 object. Note that s and s2 refer to different objects. 
s2 = s.rename("different") 
s2.name

'different'

## 11. Data Frames 
DataFrames are the workhorse of pandas and are directly inspired by the R programming language. 
Like Series, DataFrame accepts many different kinds of input: 
Dict of 1D ndarrays, lists, dicts, or Series
 2-D numpy.ndarray
 Structured or record ndarray
 A Series
 Another DataFrame 
Along with the data, you can optionally pass index (row labels) and columns (column labels) arguments.
 If you pass an index and / or columns, you are guaranteeing the index and / or columns of the resulting DataFrame.
 Thus, a dict of Series plus a specific index will discard all data not matching up to the passed index.
 If axis labels are not passed, they will be constructed from the input data based on common sense rules

In [33]:
""" A dict is created """
d = { 
'one' : pd.Series([1., 2., 3.], index=['a', 'b', 'c']),
'two' : pd.Series([1., 2., 3., 4.], index=['a', 'b', 'c', 'd']) 
} 
df=pd.DataFrame(d) 
df

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [37]:
""" a data frame will be constructed for given row labels"""

pd.DataFrame(d, index=['d', 'b', 'a'])

   one  two
d  NaN  4.0
b  2.0  2.0
a  1.0  1.0

In [39]:
"""following example shows a data frame when we give coloumn labels"""
pd.DataFrame(d, index=['d', 'b', 'a'], columns=['two', 'three'])

   two three
d  4.0   NaN
b  2.0   NaN
a  1.0   NaN

In [40]:
df.columns

Index(['one', 'two'], dtype='object')

## 11.2 From dict of ndarrays / lists 
The ndarrays must all be the same length.
 If an index is passed, it must clearly also be the same length as the arrays.
 If no index is passed, the result will be range(n), where n is the array length.

In [42]:

"""followind examples shows that ndarray has same length"""
d = { 
'one' : [1., 2., 3., 4.],
'two' : [4., 3., 2., 1.] 
} 
"""column labels are not given so 
the result will be range(n), where n is the array length""" 
pd.DataFrame(d)

   one  two
0  1.0  4.0
1  2.0  3.0
2  3.0  2.0
3  4.0  1.0

In [43]:
pd.DataFrame(d, index=['a', 'b', 'c', 'd'])

   one  two
a  1.0  4.0
b  2.0  3.0
c  3.0  2.0
d  4.0  1.0

## 11.3 From a list of dicts

In [44]:
"""constructing data frame from a list of dicts""" 
data2 = [{'a': 1, 'b': 2}, {'a': 5, 'b': 10, 'c': 20}]
pd.DataFrame(data2)

   a   b     c
0  1   2   NaN
1  5  10  20.0

In [45]:
pd.DataFrame(data2, index=['first', 'second'])

        a   b     c
first   1   2   NaN
second  5  10  20.0

In [47]:
"""passing list of dicts as data and columns (columns labels)"""
pd.DataFrame(data2, columns=['a', 'b'])

   a   b
0  1   2
1  5  10

## 11.4 From a dict of tuples 
You can automatically create a multi-indexed frame by passing a tuples dictionary

In [48]:
pd.DataFrame({('a', 'b'): {('A', 'B'): 1, ('A', 'C'): 2}, 
('a', 'a'): {('A', 'C'): 3, ('A', 'B'): 4},
 ('a', 'c'): {('A', 'B'): 5, ('A', 'C'): 6},
 ('b', 'a'): {('A', 'C'): 7, ('A', 'B'): 8},
 ('b', 'b'): {('A', 'D'): 9, ('A', 'B'): 10}})

       a              b
       b    a    c    a     b
A B  1.0  4.0  5.0  8.0  10.0
  C  2.0  3.0  6.0  7.0   NaN
  D  NaN  NaN  NaN  NaN   9.0

## 11.5 Alternate Constructors 
DataFrame.from_dict 
DataFrame.from_dict
 takes a dict of dicts or a dict of array-like sequences and returns a DataFrame. 
It operates like the DataFrame constructor except for the orient parameter which is 'columns' by default, but which can be set to 'index' in order
 to use the dict keys as row labels. 
DataFrame.from_records 
DataFrame.from_records
 takes a list of tuples or an ndarray with structured dtype. 
Works analogously to the normal DataFrame constructor, except that index maybe be a specific field of the structured dtype to use as the 
index.

In [49]:
data = np.zeros((2,), dtype=[('A', 'i4'),('B', 'f4'),('C', 'a10')]) 
data

array([(0, 0., b''), (0, 0., b'')],
      dtype=[('A', '<i4'), ('B', '<f4'), ('C', 'S10')])

In [50]:
pd.DataFrame.from_records(data, index='C')

     A    B
C
b''  0  0.0
b''  0  0.0

## DataFrame.from_dict 
## DataFrame.from_dict
 takes a dict of dicts or a dict of array-like sequences and returns a DataFrame. 
It operates like the DataFrame constructor except for the orient parameter which is 'columns' by default, but which can be set to 'index' in order
 to use the dict keys as row labels. 
## DataFrame.from_records 
## DataFrame.from_records
 takes a list of tuples or an ndarray with structured dtype. 
Works analogously to the normal DataFrame constructor, except that index maybe be a specific field of the structured dtype to use as the 
index. For example:

In [51]:
data = np.zeros((2,), dtype=[('A', 'i4'),('B', 'f4'),('C', 'a10')]) 
data

array([(0, 0., b''), (0, 0., b'')],
      dtype=[('A', '<i4'), ('B', '<f4'), ('C', 'S10')])

In [52]:
pd.DataFrame.from_records(data, index='C')

     A    B
C
b''  0  0.0
b''  0  0.0

In [57]:
import pandas as pd
df = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})
print(df)

   A  B
0  1  4
1  2  5
2  3  6

In [61]:
import pandas as pd

data = dict([('A', [1, 2, 3]), ('B', [4, 5, 6])])
df = pd.DataFrame.from_dict(data, orient='index', columns=['one', 'two', 'three'])
print(df)

   one  two  three
A    1    2      3
B    4    5      6

## 11.6 Column selection, addition, deletion

In [62]:
df['one']

A    1
B    4
Name: one, dtype: int64

In [64]:
df['three'] = df['one'] * df['two'] # assigning values to a colomn named 'three' after calculation

In [65]:
df['flag'] = df['one'] > 2 #check if value at column 'one' is > 2 then assign True otherwise false

In [66]:
df

   one  two  three   flag
A    1    2      2  False
B    4    5     20   True

In [67]:
del df['two'] #delete a coloumn 'two' from data frame

In [68]:
three = df.pop('three') #pop a complete coloumn 'three' from dataframe

In [69]:
df

   one   flag
A    1  False
B    4   True

In [70]:
df['foo'] = 'bar' #a coloumn 'foo' will be populated with 'bar'

In [71]:
df

   one   flag  foo
A    1  False  bar
B    4   True  bar

In [72]:
 df['one_trunc'] = df['one'][:2]

In [73]:
df

   one   flag  foo  one_trunc
A    1  False  bar          1
B    4   True  bar          4

In [75]:
df.insert(1, 'bar2', df['one'])

In [76]:
df

   one  bar2   flag  foo  one_trunc
A    1     1  False  bar          1
B    4     4   True  bar          4

## 11.7 Indexing / Selection 
Row selection, for example, returns a Series whose index is the columns of the DataFrame:

In [78]:
df.loc['B'] #it will return the coloumn labels and values on row label 'b'

one             4
bar2            4
flag         True
foo           bar
one_trunc       4
Name: B, dtype: object

## 11.8 Data alignment and arithmetic 
Data alignment between DataFrame objects automatically align on both the columns and the index (row labels). 
Again, the resulting object will have the union of the column and row labels.

In [81]:
 df = pd.DataFrame(np.random.randn(10, 4), columns=['A', 'B', 'C', 'D'])

In [84]:
 df2 = pd.DataFrame(np.random.randn(7, 3), columns=['A', 'B', 'C'])

In [85]:
df+df2

          A         B         C   D
0 -1.820948 -0.486120 -0.886483 NaN
1 -0.461743  1.088237  0.281200 NaN
2  0.675820  0.172114 -1.697285 NaN
3 -2.110138 -1.476548  0.799935 NaN
4  2.314831 -1.733302 -3.525600 NaN
5  0.670412  0.106476 -2.043985 NaN
6  0.223106  1.308287  1.466554 NaN
7       NaN       NaN       NaN NaN
8       NaN       NaN       NaN NaN
9       NaN       NaN       NaN NaN

In [86]:
df - df.iloc[0]

          A         B         C         D
0  0.000000  0.000000  0.000000  0.000000
1  0.639081 -1.453420  0.016733  0.965865
2  1.290349 -0.013756 -1.726830  1.011211
3 -0.389161 -1.429068  0.605839  0.754351
4  1.018968 -0.262731 -3.133559  0.204583
5  0.290290 -0.395141 -2.381572  1.082686
6 -0.402885  0.064150 -1.247060  1.351593
7  1.896698 -0.453397 -0.675429  2.685565
8 -0.554543 -0.896165 -0.409928  1.583059
9 -0.593379  1.425349 -2.022591  1.050971

In [87]:
 df*5+2

          A          B          C          D
0 -0.158454   4.610463   5.420448  -3.422235
1  3.036952  -2.656637   5.504113   1.407088
2  6.293293   4.541683  -3.213700   1.633819
3 -2.104261  -2.534878   8.449641   0.349519
4  4.936387   3.296808 -10.247345  -2.399319
5  1.292997   2.634758  -6.487411   1.991195
6 -2.172880   4.931212  -0.814852   3.335728
7  9.325035   2.343478   2.043300  10.005591
8 -2.931170   0.129636   3.370807   4.493058
9 -3.125348  11.737207  -4.692508   1.832618

In [88]:
1/df

          A          B           C           D
0 -2.316473   1.915369    1.461797   -0.922129
1  4.821825  -1.073736    1.426895   -8.432953
2  1.164607   1.967200   -0.959012  -13.654438
3 -1.218246  -1.102566    0.775237   -3.029420
4  1.702773   3.855622   -0.408252   -1.136540
5 -7.072106   7.877016   -0.589108 -567.876488
6 -1.198213   1.705779   -1.776292    3.743277
7  0.682591  14.556984  115.472164    0.624563
8 -1.013958  -2.673277    3.647487    2.005569
9 -0.975544   0.513494   -0.747104  -29.871764

In [89]:
df**4

          A          B             C             D
0  0.034729   0.074300  2.190039e-01  1.383036e+00
1  0.001850   0.752332  2.412306e-01  1.977340e-04
2  0.543603   0.066774  1.182236e+00  2.876767e-05
3  0.454004   0.676678  2.768613e+00  1.187305e-02
4  0.118952   0.004525  3.599879e+01  5.993242e-01
5  0.000400   0.000260  8.302729e+00  9.615778e-12
6  0.485136   0.118116  1.004482e-01  5.093215e-03
7  4.606370   0.000022  5.624589e-09  6.571941e+00
8  0.946062   0.019581  5.649692e-03  6.180873e-02
9  1.104112  14.383269  3.209782e+00  1.255904e-06

In [90]:
 df1 = pd.DataFrame({'a' : [1, 0, 1], 'b' : [0, 1, 1] }, dtype=bool)

In [91]:
 df2 = pd.DataFrame({'a' : [0, 1, 1], 'b' : [1, 1, 0] }, dtype=bool)

In [92]:
 pd.DataFrame({'a' : [0, 1, 1], 'b' : [1, 1, 0] }, dtype=bool)

       a      b
0  False   True
1   True   True
2   True  False

In [93]:
df1 & df2

       a      b
0  False  False
1  False   True
2   True  False

In [94]:
 df1 | df2 # or operator

      a     b
0  True  True
1  True  True
2  True  True

In [95]:
-df1

       a      b
0  False   True
1   True  False
2  False  False

## 11.9 Transposing 
To transpose, access the T attribute (also the transpose function), similar to an ndarray

In [97]:
# only show the first 5 rows
df[:5].T

          0         1         2         3         4
A -0.431691  0.207390  0.858659 -0.820852  0.587277
B  0.522093 -0.931327  0.508337 -0.906976  0.259362
C  0.684090  0.700823 -1.042740  1.289928 -2.449469
D -1.084447 -0.118582 -0.073236 -0.330096 -0.879864

In [98]:
# Creating a DataFrame by passing a numpy array, with a datetime index and labeled columns:
dates = pd.date_range('20130101', periods=6)

In [99]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [100]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))

In [101]:
df

                   A         B         C         D
2013-01-01  2.000382 -1.026013 -1.628061  1.896950
2013-01-02  0.868973 -0.656521 -0.102029  0.293518
2013-01-03  0.927506  0.607261 -0.614790  0.411855
2013-01-04 -0.034830  0.375967 -0.003649 -0.974922
2013-01-05  0.684223  0.281003  2.216992  0.286556
2013-01-06 -1.120403  0.667907 -1.316956 -1.763527

Creating a DataFrame by passing a dict of objects that can be converted to series-like.

In [102]:
df2 = pd.DataFrame({ 'A' : 1., 
'B' : pd.Timestamp('20130102'),
 'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
 'D' : np.array([3] * 4,dtype='int32'),
 'E' : pd.Categorical(["test","train","test","train"]),
 'F' : 'foo' })

In [103]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [105]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

## 12. Viewing Data 

We can view data / display data in different ways:

See the top & bottom rows of the frame 

Selecting a single column 

Selecting via [], which slices the rows 

For getting a cross section using a label 

Selecting on a multi-axis by labe 

Showing label slicing, both endpoints are included 

Reduction in the dimensions of the returned object 

For getting a scalar value 

For getting fast access to a scalar 

Select via the position of the passed integers 

By integer slices, acting similar to numpy/python 

By lists of integer position locations, similar to the numpy/python style

 For slicing rows explicitly 

For slicing columns explicitly 

For getting a value explicitly

For getting fast access to a scalar 

Using a single column’s values to select data. 

Selecting values from a DataFrame where a boolean condition is met. 

Using the isin() method for filtering

In [106]:
df.head()

                   A         B         C         D
2013-01-01  2.000382 -1.026013 -1.628061  1.896950
2013-01-02  0.868973 -0.656521 -0.102029  0.293518
2013-01-03  0.927506  0.607261 -0.614790  0.411855
2013-01-04 -0.034830  0.375967 -0.003649 -0.974922
2013-01-05  0.684223  0.281003  2.216992  0.286556

In [107]:
df.tail(3)

                   A         B         C         D
2013-01-04 -0.034830  0.375967 -0.003649 -0.974922
2013-01-05  0.684223  0.281003  2.216992  0.286556
2013-01-06 -1.120403  0.667907 -1.316956 -1.763527

In [108]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [109]:
df.columns # display columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [110]:
df.values # display all values

array([[ 2.00038217, -1.02601348, -1.62806053,  1.89695037],
       [ 0.86897344, -0.65652095, -0.1020291 ,  0.29351813],
       [ 0.92750575,  0.60726087, -0.61479029,  0.41185515],
       [-0.03483005,  0.37596686, -0.00364877, -0.97492176],
       [ 0.68422324,  0.28100268,  2.21699232,  0.28655573],
       [-1.12040347,  0.66790676, -1.31695557, -1.76352701]])

In [111]:
df.T # transpose

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    2.000382    0.868973    0.927506   -0.034830    0.684223   -1.120403
B   -1.026013   -0.656521    0.607261    0.375967    0.281003    0.667907
C   -1.628061   -0.102029   -0.614790   -0.003649    2.216992   -1.316956
D    1.896950    0.293518    0.411855   -0.974922    0.286556   -1.763527

In [112]:
#Sorting by an axis
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  1.896950 -1.628061 -1.026013  2.000382
2013-01-02  0.293518 -0.102029 -0.656521  0.868973
2013-01-03  0.411855 -0.614790  0.607261  0.927506
2013-01-04 -0.974922 -0.003649  0.375967 -0.034830
2013-01-05  0.286556  2.216992  0.281003  0.684223
2013-01-06 -1.763527 -1.316956  0.667907 -1.120403

In [113]:
#Sorting by values
df.sort_values(by='B')

                   A         B         C         D
2013-01-01  2.000382 -1.026013 -1.628061  1.896950
2013-01-02  0.868973 -0.656521 -0.102029  0.293518
2013-01-05  0.684223  0.281003  2.216992  0.286556
2013-01-04 -0.034830  0.375967 -0.003649 -0.974922
2013-01-03  0.927506  0.607261 -0.614790  0.411855
2013-01-06 -1.120403  0.667907 -1.316956 -1.763527

In [114]:
#Describe shows a quick statistic summary of your data
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.554309  0.041600 -0.241415  0.025072
std    1.048622  0.708310  1.366654  1.264361
min   -1.120403 -1.026013 -1.628061 -1.763527
25%    0.144933 -0.422140 -1.141414 -0.659552
50%    0.776598  0.328485 -0.358410  0.290037
75%    0.912873  0.549437 -0.028244  0.382271
max    2.000382  0.667907  2.216992  1.896950

In [115]:
#Selecting a single column, which yields a Series, equivalent to df.A 
df['A']

2013-01-01    2.000382
2013-01-02    0.868973
2013-01-03    0.927506
2013-01-04   -0.034830
2013-01-05    0.684223
2013-01-06   -1.120403
Freq: D, Name: A, dtype: float64

In [116]:
#Selecting via [], which slices the rows. 
df[0:3]

                   A         B         C         D
2013-01-01  2.000382 -1.026013 -1.628061  1.896950
2013-01-02  0.868973 -0.656521 -0.102029  0.293518
2013-01-03  0.927506  0.607261 -0.614790  0.411855

In [117]:
 df['20130102':'20130104']

                   A         B         C         D
2013-01-02  0.868973 -0.656521 -0.102029  0.293518
2013-01-03  0.927506  0.607261 -0.614790  0.411855
2013-01-04 -0.034830  0.375967 -0.003649 -0.974922

In [119]:
#Selecting on a multi-axis by label
df.loc[:,['A','B']]

                   A         B
2013-01-01  2.000382 -1.026013
2013-01-02  0.868973 -0.656521
2013-01-03  0.927506  0.607261
2013-01-04 -0.034830  0.375967
2013-01-05  0.684223  0.281003
2013-01-06 -1.120403  0.667907

In [120]:
#Showing label slicing, both endpoints are included
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02  0.868973 -0.656521
2013-01-03  0.927506  0.607261
2013-01-04 -0.034830  0.375967

In [121]:
# Reduction in the dimensions of the returned object 
df.loc['20130102',['A','B']]

A    0.868973
B   -0.656521
Name: 2013-01-02 00:00:00, dtype: float64

In [122]:
# For getting a scalar value 
df.loc[dates[0],'A']

2.000382169090352

In [123]:
# For getting fast access to a scalar 
df.at[dates[0],'A']

2.000382169090352

In [124]:
# Select via the position of the passed integers 
df.iloc[3]

A   -0.034830
B    0.375967
C   -0.003649
D   -0.974922
Name: 2013-01-04 00:00:00, dtype: float64

In [125]:
# By integer slices, acting similar to numpy/python 
df.iloc[3:5,0:2]

                   A         B
2013-01-04 -0.034830  0.375967
2013-01-05  0.684223  0.281003

In [127]:
#By lists of integer position locations, similar to the numpy/python style
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02  0.868973 -0.102029
2013-01-03  0.927506 -0.614790
2013-01-05  0.684223  2.216992

In [128]:
# For slicing rows explicitly
df.iloc[:,1:3]

                   B         C
2013-01-01 -1.026013 -1.628061
2013-01-02 -0.656521 -0.102029
2013-01-03  0.607261 -0.614790
2013-01-04  0.375967 -0.003649
2013-01-05  0.281003  2.216992
2013-01-06  0.667907 -1.316956

In [129]:
# For getting a value explicitly 
df.iloc[1,1]

-0.6565209476802717

In [130]:
# Using a single column’s values to select data. 
df[df.A > 0]

                   A         B         C         D
2013-01-01  2.000382 -1.026013 -1.628061  1.896950
2013-01-02  0.868973 -0.656521 -0.102029  0.293518
2013-01-03  0.927506  0.607261 -0.614790  0.411855
2013-01-05  0.684223  0.281003  2.216992  0.286556

In [131]:
# Selecting values from a DataFrame where a boolean condition is met.
df[df > 0]

                   A         B         C         D
2013-01-01  2.000382       NaN       NaN  1.896950
2013-01-02  0.868973       NaN       NaN  0.293518
2013-01-03  0.927506  0.607261       NaN  0.411855
2013-01-04       NaN  0.375967       NaN       NaN
2013-01-05  0.684223  0.281003  2.216992  0.286556
2013-01-06       NaN  0.667907       NaN       NaN

In [132]:
# Using the isin() method for filtering:
df2 = df.copy()

In [133]:
df2['E'] = ['one', 'one','two','three','four','three']

In [134]:
df2

                   A         B         C         D      E
2013-01-01  2.000382 -1.026013 -1.628061  1.896950    one
2013-01-02  0.868973 -0.656521 -0.102029  0.293518    one
2013-01-03  0.927506  0.607261 -0.614790  0.411855    two
2013-01-04 -0.034830  0.375967 -0.003649 -0.974922  three
2013-01-05  0.684223  0.281003  2.216992  0.286556   four
2013-01-06 -1.120403  0.667907 -1.316956 -1.763527  three

In [135]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03  0.927506  0.607261 -0.614790  0.411855   two
2013-01-05  0.684223  0.281003  2.216992  0.286556  four